/*
 Navicat Premium Data Transfer

 Source Server         : long
 Source Server Type    : MySQL
 Source Server Version : 50558
 Source Host           : localhost:3306
 Source Schema         : cat

 Target Server Type    : MySQL
 Target Server Version : 50558
 File Encoding         : 65001

 Date: 26/12/2019 08:58:49
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for project_work_log
-- ----------------------------
DROP TABLE IF EXISTS `project_work_log`;
CREATE TABLE `project_work_log`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `target_id` int(11) DEFAULT NULL COMMENT '指标id',
  `create_user_id` int(11) DEFAULT NULL COMMENT '创建人id',
  `create_user_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '创建人姓名',
  `item_id` int(11) DEFAULT NULL COMMENT '项目id',
  `title` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '标题',
  `outline` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '概要',
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci COMMENT '内容',
  `status` int(11) DEFAULT 0 COMMENT '状态',
  `implement_time` datetime DEFAULT NULL COMMENT '实施时间',
  `remark` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '备注',
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 17 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Compact;

-- ----------------------------
-- Records of project_work_log
-- ----------------------------
INSERT INTO `project_work_log` VALUES (4, 4, 1, '李四', 1, '标题1', '这个还有那个还有别个还有未知个', '<p>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;                       这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个这个还有那个还有别个还有未知个。<br></p>', 0, NULL, NULL, '2019-12-24 16:25:14', NULL);
INSERT INTO `project_work_log` VALUES (5, 3, 1, '李四', 1, '标题2', '标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2', '<p>&nbsp;&nbsp;&nbsp;&nbsp;                        标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2。</p><p>&nbsp;&nbsp;&nbsp;&nbsp; 标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2标题2。<br></p>', 1, NULL, NULL, '2019-12-24 16:50:08', NULL);
INSERT INTO `project_work_log` VALUES (6, 4, 1, '李四', 1, '标题35', '标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3', '                        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3。</p><p>&nbsp;&nbsp;&nbsp;&nbsp; 标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3标题3。<br></p>', -1, NULL, NULL, '2019-12-24 16:54:05', '2019-12-25 18:46:13');
INSERT INTO `project_work_log` VALUES (10, 2, 1, '李四', 1, '测试', '测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试', '                        <p>测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试<br></p>', 0, NULL, NULL, '2019-12-25 20:26:02', NULL);
INSERT INTO `project_work_log` VALUES (14, 3, 1, '李四', 1, '111111111', '1111111111', '                        啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊', 0, NULL, NULL, '2019-12-25 20:30:30', NULL);
INSERT INTO `project_work_log` VALUES (15, 3, 1, '李四', 1, '222222222223331155555777777777777777打点', '222222222222222222', '                        22222222222222222222222222222222222222222222222222222222222222222222222222', 0, NULL, NULL, '2019-12-25 20:38:46', '2019-12-25 20:52:42');
INSERT INTO `project_work_log` VALUES (16, 1, 1, '李四', 1, '444444444444', '呃呃呃呃呃呃呃呃呃呃呃呃呃呃呃', '                        道氏深水虱少时诵诗书所所所所所所所所', 0, NULL, NULL, '2019-12-25 20:52:58', NULL);

SET FOREIGN_KEY_CHECKS = 1;
